{
    "equipment_dict": {
        "Chef's Knife": "https://www.amazon.com/Victorinox-Swiss-Classic-Chefs-Knife/dp/B0061SWV8Y?psc=1&SubscriptionId=AKIAJ7IODE3ZIX6FGTPA&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B0061SWV8Y?m=ATVPDKIKX0DER&tag=bonappfig-20",
        "Colander": "https://www.amazon.com/ExcelSteel-242-5-Quart-Stainless-Colander/dp/B00555ETXY/ref=sr_1_6?s=home-garden&ie=UTF8&qid=1501117020&sr=1-6&keywords=colander&tag=bonappfig-20",
        "Dutch Oven": "https://www.amazon.com/Lodge-EC6D43-Enameled-6-Quart-Island/dp/B000N501BK?psc=1&SubscriptionId=AKIAJ7IODE3ZIX6FGTPA&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B000N501BK?m=ATVPDKIKX0DER&tag=bonappfig-20",
        "Heatproof Measuring Cup": "https://www.amazon.com/Pyrex-3-Piece-Glass-Measuring-Cup/dp/B00M2J7PCI?psc=1&SubscriptionId=AKIAJM3KU4TPIXE245JA&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00M2J7PCI?m=ATVPDKIKX0DER&tag=bonappfig-20",
        "Large Pot": "https://www.webstaurantstore.com/vollrath-lincoln-3902-optio-6-3-4-qt-sauce-pot-with-cover/9223902.html",
        "Measuring Cups": "https://www.amazon.com/OXO-Good-Grips-Stainless-Measuring/dp/B00L9WJZW2?psc=1&SubscriptionId=AKIAJ7IODE3ZIX6FGTPA&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00L9WJZW2?m=ATVPDKIKX0DER&tag=bonappfig-20",
        "Measuring Spoons": "https://www.amazon.com/MIU-COLOR%C2%AE-Endurance-Measuring-Spoon/dp/B00F5JHQR6/ref=sr_1_3?s=kitchen&ie=UTF8&qid=1468867940&sr=1-3&keywords=endurance+measuring+spoons&tag=bonappfig-20",
        "Medium Bowl": "https://www.amazon.com/Pyrex-Prepware-3-Piece-Glass-Mixing/dp/B00LGLHUA0?psc=1&SubscriptionId=AKIAJ7IODE3ZIX6FGTPA&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B00LGLHUA0?m=ATVPDKIKX0DER&tag=bonappfig-20",
        "Tongs": "https://www.amazon.com/Edlund-4412-HDL-inch-Heavy/dp/B002P64OMC?psc=1&SubscriptionId=AKIAJ7IODE3ZIX6FGTPA&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B002P64OMC?m=ATVPDKIKX0DER&tag=bonappfig-20",
        "Wooden Spoon": "https://www.amazon.com/OXO-Grips-Wooden-Corner-Scraper/dp/B008H2JLPS?psc=1&SubscriptionId=AKIAJ7IODE3ZIX6FGTPA&linkCode=xm2&camp=2025&creative=165953&creativeASIN=B008H2JLPS?m=ATVPDKIKX0DER&tag=bonappfig-20"
    },
    "image_src": "https://assets.bonappetit.com/photos/5b9009799915d52d4edc0f73/3:2/w_940,c_limit/basically-pasta-pomodoro-1.jpg",
    "ingredients": [
        "3 Tbsp. kosher salt, plus more",
        "1 28-oz. can whole peeled tomatoes",
        "4 garlic cloves",
        "3 Tbsp. extra-virgin olive oil, plus more",
        "Pinch of crushed red pepper flakes, plus more",
        "3 basil sprigs, plus leaves for serving",
        "1 lb. spaghetti",
        "4 oz. Parmesan, finely grated, divided (about 1 cup)",
        "2 Tbsp. unsalted butter"
    ],
    "steps": [
        "Fill a large stock pot two-thirds full with water and heat over high to bring to a boil. Once you see the water start to steam, add 3 Tbsp. salt. We know, we know: That looks like a LOT of salt. But salting the pasta water aggressivelyit should almost be seawater-saltyis the key to making sure that every noodle is properly seasoned through and through, and is one reason why restaurant pasta tastes better than the stuff you usually make. While you wait for the water, start your sauce.",
        "Open a 28-oz. can of whole peeled tomatoes and drain contents in a colander set over medium bowl. (Whole peeled tomatoes are the only canned tomatoes worth buying, TBH. The diced ones sometimes have weird chemicals added to them to keep the chunks from breaking down. Gross.) Using clean fingers, poke a hole in the tomatoes and shake to drain liquid and seeds from the insides of each tomato, reserving liquid. Shake colander over bowl to separate the solids from all the juices and encourage liquid to drain; set aside.",
        "Smash 4 garlic cloves with the flat side of a chefs knife forcefully, so garlic breaks up into smaller bits; remove skins. If the cloves are really big, you might need to give them an extra smack to make sure they're broken up, but don't bother choppingthe garlic will infuse into the oil you sizzle it in and break down as the sauce simmers.",
        "Working next to your pasta pot, heat 3 Tbsp. oil in a large Dutch oven over medium. (We like using a Dutch oven or a large, high-sided skillet for cooking sauce and finishing pasta; it's kind of the only thing big enough to toss a whole pound of pasta in without noodles flying everywhere.) Add garlic and cook, stirring often with a wooden spoon, until garlic is golden all over, about 3 minutes.",
        "Stir in a pinch of red pepper flakes, then add drained tomatoes and increase heat to medium-high. The idea here is to concentrate the flavor of those tomato solids before adding the liquid they came in, which will give your sauce a more complex, rounded flavor. Cook, stirring occasionally, until tomatoes are darkened in color, browned and caramelized in spots, and starting to break down, 68 minutes. Don't rush this part! If you aren't getting color, let it go for another few minutes. Mash with the back of the wooden spoon to form a coarse paste.",
        "Add reserved tomato liquid to pot and stir to combine. Season with a pinch of salt, throw in 3 basil sprigs, and reduce heat so sauce is bubbling at a simmer. Cook, stirring occasionally, until liquid is reduced and sauce is thick like applesauce, 810 minutes. If your water isnt boiling yet, turn off heat under sauce while you wait. If it is, reduce heat to lowest setting and move on.",
        "Add 1 lb. pasta to pot of water and agitate with tongs to prevent sticking. Cook pasta, tossing occasionally, just until lower end of time range given on the package for al dente. If you're not sure if it's done, fish out a piece and take a nibbleit should still be slightly too crunchy to want to eat because it's going to continue cooking in the tomato sauce. Just before pasta is done, use a heatproof measuring cup to scoop out about 1 cup pasta cooking liquid.",
        "Using tongs, transfer pasta from stock pot into Dutch oven with sauce, allowing water to piggyback on pasta into sauce. (That's right, no draining!) Crank heat under sauce up to medium-high and pour in  cup reserved pasta cooking liquid. If you've never finished cooking pasta in a pan full of sauce, your life is about to be changedthis process is what ensures that every single noodle is completely coated and infused with saucy goodness, and is pretty much the main difference between a dish of \"meh\" pasta and one that blows your mind.",
        "Cook pasta, tossing constantly, until sauce is clinging to each noodle and any standing liquid is mostly absorbed, about 1 minute. You still want a saucy consistency, but not watery. If things ever start to look a little dry, just add another splash of that pasta cooking water; if they look too wet, just wait a bit for some more liquid to evaporate.",
        "Slowly sprinkle in half of the Parmesan cheese (you want the grainy stuff with the texture of shaky cheese, not Microplaned), tossing constantly, until it has melted into the sauce. Add more pasta water, a couple of tablespoons at a time, to loosen sauce if necessaryit should be plenty saucy while you're incorporating the cheese so it emulsifies into the sauce properly. You want the sauce to ooze but still be thick enough to coat the pasta.",
        "Remove pot from heat and stir in 2 Tbsp. butter until melted. Finishing with a bit of butter is almost always a good ideait makes the finished dish extra glossy and delicious. (Don't look at us like thatif you think pasta is diet food, you're kidding yourself.)",
        "Using tongs, divide pasta among bowls, then top with remaining cheese and basil leaves. Top with red pepper flakes and an extra drizzle of oil, if you feel. And there you have it: saucy, glossy Basically Spaghetti Pomodoro. Give yourself a pat on the back, and kiss the jarred stuff goodbye."
    ],
    "title": "Basically Spaghetti Pomodoro",
    "url": "https://www.bonappetit.com/recipe/basically-spaghetti-pomodoro"
}
